package Day07_EX1;//현재 클래스가 위치한 패키지명

public class Student {//설계 즉 도면 목적//클래스 첫글자 대문자임
	
		
		//필드[저장소], 생성자[객체초기화], 메소드[동작]구성
		//-생성자 생략시 기본생성자 자동 Student( )
	//클래스끝
	
	/*
	 * 객체: 식별가능한 형태 [상태=필드, 행동=메소드/함수]
	 * 객체지향프로그래밍[OOP]: 부품[객체] 먼저 만들고 부품들을 조립해서 하나의 제품[프로그래밍] 생성
	 * 
	 * 클래스: 설계도(객체의 설계도)
	 * 		인스턴스화(NEW) 
	 * 인스턴스
	 * 
	 * 
	 *
	 * 
	 * JVM관점
	 * 			스택영역	= 힙영역
	 * 		클래스명 변수명 = new 생성자();
	 * 		String str  = new String("유재석")
	 * 				<---주소---
	 * 		String str	= null
	 * 			여기가 변수 	여기가 인스턴스
	 * 			즉 인스턴스화 해주는게 new 연산자 
	 * 		
	 * 
	 * */
	
	
	
}
