/*
	1. console 아래와 같이 출력 
	\    /\ 
	 )  ( ') 
	(  /  )
	 \(__)|
*/
// 문제1		\n : 줄바꿈	\\ : \ 출력		\' : '출력		| : shift+\
console.log('\\    /\\ \n )  ( \') \n(  /  ) \n \\(__)|')
/*
	2.console 아래와 같이 출력 
	|\_/|  
	|q p|   /}  
	( 0 )"""\ 
	|"^"`    |
	||_/=\\__|
*/
console.log('|\\_/| \n|q p|\n( 0 )"""\\\n|"^" \t |\n||_/=\\\\__|')
/*
	3.console 아래와 같이 출력 
	         ,r'"7
	 r`-_   ,'  ,/
	 \. ". L_r'
	   `~\/
	      |
	      |
*/
console.log('\t\t\t,\'"7\nr\'.-_   ,  \', /\n\\.\ \". L_r \'\n \'~\ \\/\n \t |\n \t |')
